In [1]:
import pandas as pd

### Create Data

In [2]:
data = {
    'Name':['Pandy','Sandy','Randy','Mandy','Candy','Landy'],
    'Age':[6,7,4,5,4,2],
    'Bamboo Stick': [10,15,20,25,30,35]
}

In [3]:
df=pd.DataFrame(data)

In [4]:
df

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

### Head (first five rows)

In [5]:
df.head()

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30

In [6]:
df.head(2)

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15

### Tail (last five rows)

In [7]:
df.tail()

    Name  Age  Bamboo Stick
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

In [8]:
df.tail(3)

    Name  Age  Bamboo Stick
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

### Filtering

In [9]:
df[df['Age']<5]

    Name  Age  Bamboo Stick
2  Randy    4            20
4  Candy    4            30
5  Landy    2            35

df[df['Age']<5] 
df, data frame name used for filtering
[df['Age']<5] is the logic

#### Multiple filtering

In [73]:
df_excel

   Duration  Pulse  Maxpulse
0        60    110       130
1        60    117       145
2        60    103       135
3        45    109       175
4        45    117       148
5        60    102       127

In [83]:
df_excel[['Duration','Pulse']]

   Duration  Pulse
0        60    110
1        60    117
2        60    103
3        45    109
4        45    117
5        60    102

In [84]:
df_excel[(df_excel['Duration']>50) & (df_excel['Pulse']>105)]

   Duration  Pulse  Maxpulse
0        60    110       130
1        60    117       145

### Add Column

In [10]:
df['Place']=['Greenland', 'Siberia', 'Antartica','Greenland', 'Siberia', 'Antartica']

In [11]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

### Update

In [12]:
df.loc[df['Name']== 'Pandy', 'Age']=6

In [13]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

df.loc is the function name, df is the name of the dataframe
[df['Name']== 'Pandy', 'Age'] tracks row location
['Name']== 'Pandy' Row information
=6 is the updated value

### Delete

#### Delete one Column

In [14]:
df.drop('Place',axis=1)

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

In [15]:
#### Delete multiple Column

In [16]:
#df.drop(['Place','Bamboo Stick'],axis=1)

#### Delete Row

In [17]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

In [18]:
 df.drop(df[df['Name'] == 'Candy'].index)

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
5  Landy    2            35  Antartica

‚úÖ df[df['Name'] == 'Sandy'].index gives you the actual row index/indices where Name == 'Sandy'.
üîç .index in pandas is used to access the row labels (i.e., the indices) of a DataFrame or Series.

In [19]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

### iloc

### show row data

In [20]:
df.iloc[2]

Name                Randy
Age                     4
Bamboo Stick           20
Place           Antartica
Name: 2, dtype: object

In [21]:
df.iloc[:3]

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica

In [22]:
df.iloc[1:3]

    Name  Age  Bamboo Stick      Place
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica

### show coulmn data

In [23]:
df ['Place']

0    Greenland
1      Siberia
2    Antartica
3    Greenland
4      Siberia
5    Antartica
Name: Place, dtype: object

#### row and column

In [24]:
df.iloc [0:2,1:3]

   Age  Bamboo Stick
0    6            10
1    7            15

###  New index

In [25]:
import pandas as pd

df = pd.DataFrame(
    {
        'Name': ['Pandy', 'Sandy', 'Randy', 'Mandy', 'Candy', 'Landy'],
        'Age': [6, 7, 4, 5, 4, 2],
        'Bamboo Stick': [10, 15, 20, 25, 30, 35]
    },
    index=['a', 'b', 'c', 'd', 'e', 'f']
)

In [26]:
df

    Name  Age  Bamboo Stick
a  Pandy    6            10
b  Sandy    7            15
c  Randy    4            20
d  Mandy    5            25
e  Candy    4            30
f  Landy    2            35

### loc

#### column

In [27]:
df.loc['b']

Name            Sandy
Age                 7
Bamboo Stick       15
Name: b, dtype: object

#### both row & column

In [28]:
df.loc[['b','c'], ['Name','Age']]

    Name  Age
b  Sandy    7
c  Randy    4

### Conevrt to csv

In [42]:
df.to_csv('panda.csv')

We would see a csv file on the local folder

#### No index

In [43]:
df.to_csv('noIndex_panda.csv', index=False)

In [44]:
df

    Name  Age  Bamboo Stick
a  Pandy    6            10
b  Sandy    7            15
c  Randy    4            20
d  Mandy    5            25
e  Candy    4            30
f  Landy    2            35

### Statistical Analysis

In [45]:
df.describe()

            Age  Bamboo Stick
count  6.000000      6.000000
mean   4.666667     22.500000
std    1.751190      9.354143
min    2.000000     10.000000
25%    4.000000     16.250000
50%    4.500000     22.500000
75%    5.750000     28.750000
max    7.000000     35.000000

### Json

In [47]:
df_json=pd.read_json('test.json')

In [49]:
df_json

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

In [50]:
df_json.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406

### shape

In [52]:
df_json.shape

(6, 4)

### Read CSV

In [54]:
df_json.to_csv("test_excel.csv",index=False)

In [55]:
df_csv=pd.read_csv("test_excel.csv")

In [56]:
df_csv

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

### excel convert

In [60]:
df_excel=df_csv.drop('Calories',axis=1)

In [61]:
df_excel

   Duration  Pulse  Maxpulse
0        60    110       130
1        60    117       145
2        60    103       135
3        45    109       175
4        45    117       148
5        60    102       127

pip install openpyxl

In [66]:
df_excel.to_excel("output.xlsx",index=False)

In [72]:
df_excel

   Duration  Pulse  Maxpulse
0        60    110       130
1        60    117       145
2        60    103       135
3        45    109       175
4        45    117       148
5        60    102       127

###  Data Merge

In [94]:
left= pd.DataFrame({
    'ID': [1,2,3],
    'Name': ['Pandy', 'Mandy',' Sandy']
})
right= pd.DataFrame({
    'ID': [1,2,4],
    'Hobby': ['Eating', 'Dancing',' Sleeping']
})

In [95]:
merged_df=pd.merge(left,right, on='ID', how='inner')

In [96]:
merged_df

   ID   Name    Hobby
0   1  Pandy   Eating
1   2  Mandy  Dancing

### concat

### row

In [99]:
concat_df=pd.concat([left,right],ignore_index=True) #ignore index helps to prevent overflow of index

In [100]:
concat_df

   ID    Name      Hobby
0   1   Pandy        NaN
1   2   Mandy        NaN
2   3   Sandy        NaN
3   1     NaN     Eating
4   2     NaN    Dancing
5   4     NaN   Sleeping

### coulmn

In [102]:
concat_df=pd.concat([left,right],axis=1)

In [103]:
concat_df

   ID    Name  ID      Hobby
0   1   Pandy   1     Eating
1   2   Mandy   2    Dancing
2   3   Sandy   4   Sleeping